p '16. Дано цілочисельний масив. Перевірити, чи утворюють елементи геометричну прогресію. Якщо так, то вивести знаменник прогресії, якщо ні – вивести nil.'
p '[8, 24, 72, 216, 648, 1944, 5832, 17496, 52488, 157464, 472392, 1417176, 4251528, 12754584, 38263752]'
array = [8, 24, 72, 216, 648, 1944, 5832, 17496, 52488, 157464, 472392, 1417176, 4251528, 12754584, 38263752]
p (1...array.size).all? {|i| array[i] / array[i-1] == (array.last/array.first)**(1/(array.size-1).to_f)} ? (array.last/array.first)**(1/(array.size-1).to_f) : nil
