p '59. Дано цілочисельний масив. Знайти кількість елементів, між першим і останнім мінімальним'
p '[15, 87, 97, -94, 12, 14, 15, 18, 25, 38, -14, 17, 25, -24, 99, -94, 50]'
array = [15, 87, 97, -94, 12, 14, 15, 18, 25, 38, -14, 17, 25, -24, 99, -94, 50]
a2 = array.min(2)
#якщо мінімальний елемент в масиві 1, є проблема помилки підрахунку різниці (не треба віднімати 1), тому перевіряємо на повторюваність найменшого елемента
p a2[0] == a2[1] ? array.rindex(array.min) - array.index(array.min) - 1 :  0  
 