p '60. Дано цілочисельний масив. Знайти кількість елементів, між першим і останнім максимальним'
p '[15, 87, 97, -94, 99, 14, 15, 18, 25, 38, -14, 17, 25, -24, 99, -94, 50]'
array = [15, 87, 97, -94, 99, 14, 15, 18, 25, 38, -14, 17, 25, -24, 99, -94, 50]
a2 = array.max(2)
#якщо максимальний елемент в масиві 1, є проблема помилки підрахунку різниці (не треба віднімати 1), тому перевіряємо на повторюваність найбільшого елемента
p a2[0] == a2[1] ? array.rindex(array.max) - array.index(array.max) - 1 :  0  
